import React from 'react';

function Main() {
    const attractions = [
        {
            id: 1,
            name: 'Площадь тысячелетия',
            description: 'Площадь обустроена в 2012 году в честь тысячелетия со дня присоединения мордвы к российскому государству. В центре площади — огромный фонтан диаметром 60 метров, оформленный в виде мордовской звезды, символа солнца. Струи фонтана поднимаются на высоту до 40 метров. Есть зона, где можно ходить по воде босиком. Вечером включаются музыка и подсветка — начинается светомузыкальное шоу. ',
            image: 'https://cdn2.tu-tu.ru/image/pagetree_node_data/1/71f9489daa989d53041a0518c214a48e/'
        },
        {
            id: 2,
            name: 'Кафедральный собор святого праведного воина Феодора Ушакова',
            description: 'Церковь, имеющая статус главного храма Мордовии, построена в 2006 году. В церемонии открытия участвовал патриарх Алексий II. Храм может вместить 3 000 человек. Высота церкви вместе с купольным крестом составляет 62 метра. На крыше есть смотровая площадка с платным входом. Собор носит имя адмирала Феодора Ушакова, который выиграл 43 морских сражения и не потерял ни одного судна. Флотоводец был праведным человеком и окончил свои дни в Санаксарском монастыре в Мордовии. Причислен к лику святых православной церковью.',
            image: 'https://cdn2.tu-tu.ru/image/pagetree_node_data/1/706295335d2930037d8c0fdbe18d4796/'
        },
        {
            id: 3,
            name: 'Музей изобразительных искусств им. С.Д. Эрьзи',
            description: 'Степан Эрьзи — известный скульптор родом из Мордовии. Свою карьеру начинал с росписи храмов, как скульптор прославился еще в царской России, большую известность получил в Европе, а затем, после эмиграции, и в Аргентине. ',
            image: 'https://cdn2.tu-tu.ru/image/pagetree_node_data/1/ce7790bb6c861e5c700f9598b66427d7/'
        },
        {
            id: 4,
            name: 'Республиканский краеведческий музей им. И.Д. Воронина',
            description: 'В музее хранятся предметы быта и документы, рассказывающие историю края. В фондах музея насчитывается более 200 тысяч памятников истории, есть палеонтологическая, зоологическая и ботаническая экспозиции.',
            image: 'https://cdn2.tu-tu.ru/image/pagetree_node_data/1/9a56ccbc6a3de9aea9d70301a92c7faf/'
        }
    ];

    return (
        <main className="main">
            <section className="about">
                <h2>О городе</h2>
                <p>
                    Сара́нск (мокш. Саранск ошсь, Саранскяйсь, эрз. Саран ош, Саранскоесь) — город в России, столица Республики Мордовия и административный центр одноимённого городского округа. Расположен в центральной части Восточно-Европейской равнины, на Приволжской возвышенности, в месте слияния рек Саранки и Инсар (бассейн Волги), примерно в 600 километрах к востоку от Москвы
                </p>
            </section>

            <section className="attractions">
                <h2>Достопримечательности</h2>
                <div className="cards">
                    {attractions.map(item => (
                        <div key={item.id} className="card">
                            <img src={item.image} alt={item.name} />
                            <h3>{item.name}</h3>
                            <p>{item.description}</p>
                        </div>
                    ))}
                </div>
            </section>
        </main>
    );
}

export default Main;